import React from 'react'

export const UserAgreement = (): JSX.Element => (
  <>
    <h3>Договір публічної оферти</h3>
    <p>
      Користування послугами цього сайту регулюється правилами та умовами,
      описаними нижче.
    </p>
    <h3>1. Поняття і визначення</h3>
    <p>
      Сайт є платформою, на якій користувачі можуть придбати ваучери (та інші
      форми, ф’ючерси і т.п.) на послуги та товари, за цінами та на умовах, які
      встановлює надавач послуг чи продавець товарів на цьому сайті.
      <br />
      Користувач – користувач сайту magaziner.com.ua.
      <br />
      Бізнес – це надавач послуг, від імені якого було створено ваучери.
      <br />
      Ваучер – послуга Сайту, яка дозволяє, шляхом оплати, благодійно допомогти
      Бізнесу або придбати змогу скористатися послугами Бізнесу у розмірі
      номіналу ваучеру.
    </p>
    <h3>2. Загальні положення</h3>
    <p>
      2.1. Сайт є платформою, на якій користувачі можуть придбати ваучери (та
      інші форми, ф’ючерси і т.п.) на послуги та товари, за цінами та на умовах,
      які встановлює надавач послуг чи продавець товарів на цьому сайті.
      <br />
      2.2. Придбаний ваучер (та інші форми, ф’ючерси і т.п.) не підлягає обміну
      або поверненню.
      <br />
      2.3. Власник сайту та правовласник не несе жодної відповідальності за
      невиконання надавачем послуг чи продавцем товарів своїх зобов’язань перед
      користувачем сайту та покупцем ваучеру.
      <br />
      2.4. Даний сайт у цілому, й окремі його елементи охороняються Законом
      України “Про авторське право і суміжні права”, іншими актами чинного
      законодавства України та міжнародними договорами.
    </p>
    <h3>3. Оформлення та покупка Ваучерів</h3>
    <p>
      3.1. Для покупки ваучеру потрібно вибрати Бізнес, потім номінал ваучер та
      виконати оплату.
      <br />
      3.2. Сайт не несе відповідальності за достовірність інформації, яку надав
      Клієнт при покупці Ваучера.
      <br />
      3.3. Ваучер Користувача може бути оформлений на сайті magaziner.com.ua.
      <br />
      3.4. Ціна ваучеру вказується на сайті magaziner.com.ua
      <br />
      3.5. Ціна ваучеру може бути змінена Сайтом або Бізнесом у односторонньому
      порядку.
    </p>
    <h3>4. Права та обов’язки Сайту</h3>
    <p>
      4.1. Сайт має право змінювати номінали Ваучерів для нових Користувачів.
      <br />
      4.2. Сайт зобов’язується передати всю суму номіналу Ваучера Бізнесу, але з
      урахуванням вилучення комісії від платіжної системи.
    </p>
    <h3>5. Права та обов’язки Користувача</h3>
    <p>
      5.1. Користувач має смогу допомогти бізнесу, шляхом покупки ваучера.
      <br />
      5.2. Користувач має право придавати Ваучер.
      <br />
      5.3. Користувач, має змогу придбати ваучер, та вимагати від Бізнесу,
      виконати послуги у розмірі на суму ваучеру, при умові, що Бізнес має
      змогу.
      <br />
      5.4. Користувач має право оформити ваучер на будь-яку іншу особу. В такому
      випадку ця особа стає власником ваучера, після покупки ваучера
      Користувачем.
      <br />
      5.5. Користувач має право звернутися до адміністрації Сайту, якщо щось
      незрозуміло, або виникли питання.
    </p>

    <h3>6. Обмеження відповідальності</h3>
    <p>
      6.1. Власник сайту та правовласник не несе відповідальності за упущену
      вигоду, неотриманий прибуток, втрату даних, моральну шкоду, шкоду честі,
      гідності та діловії репутації або будь-які інші збитки користувачам сайту.
      <br />
      6.2. Користувач сайту використовує сайт на свій власний ризик.
      <br />
      6.3. У межах, які максимально дозволяє закон, будь-яка сторона, яка
      залучена до створення, виробництва або обслуговування сайту, не несе
      відповідальності за пряме, непряме або випадкове пошкодження, які
      будь-коли завдавалися та які були спричинені тим, що користувач мав доступ
      до сайту, користувався ним або сподівався на нього, навіть якщо його було
      попереджено про можливість таких пошкоджень та втрат.
      <br />
      6.4. Власник сайту не гарантує та не стверджує, що використання матеріалу,
      який надається на сайті, не зашкодить інтересам третіх осіб.
      <br />
      6.5. Сайт може містити посилання на інші сайти. Такі посилання наведені
      винятково для інформаційних цілей та допомагають найбільш повно розкрити
      інформацію або ілюструють розміщений матеріал. Власники та сторони,
      причетні до створення цього сайту, не несуть відповідальності за політику
      конфіденційності або зміст цих сайтів.
    </p>
    <h3>7. Вирішення суперечок</h3>
    <p>
      7.1. Усі суперечки, які виникають з цієї угоди або пов’язані з нею,
      вирішуються шляхом переговорів між сторонами.
      <br />
      7.2. Якщо суперечку неможливо вирішити шляхом переговорів, вона
      вирішується у судовому порядку за місцем перебування власника сайту у
      відповідності до чинного законодавства.
    </p>
    <h3>8. Строк дії угоди</h3>
    <p>
      8.1. Угода набирає чинності з дня початку користування цим сайтом та діє
      до моменту виконання сторонами своїх обов’язків.
    </p>

    <h3>9. Політика конфіденційності</h3>
    <p>
      9.1. Сайт гарантує збереження таємниці інформації, що її Користувач вказує
      при реєстрації або при оформленні замовлення.
      <br />
      9.2. Сайт гарантує, що персональні дані не будуть використані в корисливих
      цілях, на сторонніх ресурсах або для поширення спаму.
      <br />
      9.3. При оформленні замовлення Користувач дає згоду на обробку своїх
      персональних даних, що зберігаються в базі Сайту виключно для
      ідентифікації Користувача при повторних замовленнях і для коректного їх
      виконання. При відмові Користувачем Сайт не зможе відповідним чином
      провести замовлення.
    </p>

    <h3>10. Персональні дані</h3>
    <p>
      10.1. Персональні дані – це відомості чи сукупність відомостей про фізичну
      особу, яка ідентифікована або може бути конкретно ідентифікована.
      <br />
      10.2. При реєстрації на сайті користувач дає згоду на обробку своїх
      персональних і реєстраційних даних.
      <br />
      10.2. Якщо користувач приймає рішення надати свої персональні дані, він,
      тим самим, дає згоду на передачу та зберігання цих даних, а також надає
      дозвіл правовласнику на неперсоналізовану обробку своїх даних для
      покращення сервісу та збору статистики ринку.
      <br />
      10.3. Користувачу на сайті може бути запропоновано ввести персональні
      дані, зокрема ім’я, прізвище, адресу електронної пошти, номер телефону,
      дату народження, стать, а також зареєструватися на сайті за допомогою
      соціальних мереж та веб-систем, таких, як Twitter, Facebook, Telegram,
      Flipboard, Google тощо.
      <br />
      10.4. Персональні дані відвідувачів використовуються відповідно до Законів
      України “Про захист персональних даних”, “Про інформацію”, “Про рекламу”,
      “Про телекомунікації”, “Про підприємництво”, “Про захист інформації в
      інформаційно-телекомунікаційних системах”.
    </p>
  </>
)
